Complaints_internet/output.xml

<ns0:Envelope xmlns:ns0="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="urn:siemens:names:prov:gw:SPML:2:0">
   <ns0:Body>
      <ns1:searchRequest execution="synchronous">
         <version>HLR_SUBSCRIBER_v45</version>
         <base>
            <objectclass>Subscriber</objectclass>
<<<<<<< HEAD
            <alias name="msisdn" value="237663744490" />
=======
            <alias name="msisdn" value="237668608391" />
>>>>>>> parent of 9209211... mise a jour pour le traitement pas d'internet
         </base>
      </ns1:searchRequest>
   </ns0:Body>
</ns0:Envelope>